In [22]:
people={'first_name':['John','Jerry','Joe'],
         'last_name': ['Doe','Nolan','Perry'],
         'email': ['john@gmail.com','jerry@gmail.com','joe@gmail.com']
        }

In [23]:
import pandas as pd
df=pd.DataFrame(people)

In [24]:
df

  first_name last_name            email
0       John       Doe   john@gmail.com
1      Jerry     Nolan  jerry@gmail.com
2        Joe     Perry    joe@gmail.com

In [27]:
df['full_name']=df['first_name']+' '+df['last_name']

In [28]:
df

  first_name last_name            email    full_name
0       John       Doe   john@gmail.com     John Doe
1      Jerry     Nolan  jerry@gmail.com  Jerry Nolan
2        Joe     Perry    joe@gmail.com    Joe Perry

In [31]:
df.drop(columns=['first_name','last_name'],inplace=True)

In [32]:
df

             email    full_name
0   john@gmail.com     John Doe
1  jerry@gmail.com  Jerry Nolan
2    joe@gmail.com    Joe Perry

In [38]:
df['full_name'].str.split(expand=True)

       0      1
0   John    Doe
1  Jerry  Nolan
2    Joe  Perry

In [39]:
df[['first_name','last_name']]=df['full_name'].str.split(expand=True)

In [40]:
df

             email    full_name first_name last_name
0   john@gmail.com     John Doe       John       Doe
1  jerry@gmail.com  Jerry Nolan      Jerry     Nolan
2    joe@gmail.com    Joe Perry        Joe     Perry

In [41]:
df.drop(columns=['full_name'],inplace=True)

In [42]:
df

             email first_name last_name
0   john@gmail.com       John       Doe
1  jerry@gmail.com      Jerry     Nolan
2    joe@gmail.com        Joe     Perry